In [33]:
# Instalando os Pacotes - Mysql
!pip install pymysql
import pandas as pd

Requirement already satisfied: pymysql in c:\users\dpits\anaconda3\lib\site-packages (1.0.2)

[notice] A new release of pip available: 22.3.1 -> 24.0
[notice] To update, run: python.exe -m pip install --upgrade pip

In [34]:
# Importar Módulo pandas
import pandas as pd
# importar o módulo pymysql
import pymysql

In [35]:
# converter do pymysql para o Mysql
pymysql.install_as_MySQLdb()

In [36]:
#import mysql.connector
import MySQLdb

In [37]:
# Configurações para MYSQL connection
db = MySQLdb.connect(
    host="localhost",
    user="root",
    password="",
    database="aula"
)

In [38]:
# Cricar um objeto cursor. Isso permitirá que você execute todas as consultas necessárias
cur = db.cursor()

In [39]:
# Selecionar o que retornar todos os dados da tabela.
cur.execute("SELECT * FROM tb_cliente")

15

In [40]:
# Converter os dados para DATAFRAME
tb_cliente_mysql = pd.DataFrame(cur.fetchall())

In [41]:
# Visualizar os dados do DATAFRAME
tb_cliente_mysql.head()

   0               1             2       3    4    5   6       7     8  9
0  1            José    Das flores  Centro  454  111  rn  987118  None  m
1  2  Pires da Silva        Do rio  Grotão  565  222  pb  123478  None  m
2  3         Mariana  Do horizonte   Derba  573  333  ba  765432   5.0  f
3  4   Yasmin Moneta    Do litoral  Ondina  762  444  ba  223444  None  f
4  5       Igor Ralf   Do interior   Marés  656  555  rj  556677   3.0  m

In [42]:
#Adicionar o nome para as colunas
tb_cliente_mysql = tb_cliente_mysql.rename(columns={
                                                    0: 'Codigo',
                                                    1: 'Nome',
                                                    2: 'Logradouro',
                                                    3: 'Bairro',
                                                    4: 'Cep',
                                                    5: 'CPF',
                                                    6: 'UF',
                                                    7: 'Telefone',
                                                    8: 'Desconto',
                                                    9: 'Sexo'
                                                })

In [43]:
# Visualizar os dados com as colunas renomeadas
tb_cliente_mysql.head()

,Desconto,Sexo,Logradouro,Bairro,Cep,CPF,UF,Telefone,8,9
0,1,José,Das flores,Centro,454,111,rn,987118,None,m
1,2,Pires da Silva,Do rio,Grotão,565,222,pb,123478,None,m
2,3,Mariana,Do horizonte,Derba,573,333,ba,765432,5.0,f
3,4,Yasmin Moneta,Do litoral,Ondina,762,444,ba,223444,None,f
4,5,Igor Ralf,Do interior,Marés,656,555,rj,556677,3.0,m